{"summary":"","description":"<p> </p><p>The <span class=\"code\">start_erl</span> program is specific to Windows NT/2000/XP (and later versions of Windows). Although there are programs with the same name on other platforms, their functionality is different.</p> <p>This program is distributed both in compiled form (under &lt;Erlang root&gt;\\\\erts-&lt;version&gt;\\\\bin) and in source form (under &lt;Erlang root&gt;\\\\erts-&lt;version&gt;\\\\src). The purpose of the source code is to ease customization of the program for local needs, such as cyclic restart detection. There is also a &quot;make&quot;-file, written for the <span class=\"code\">nmake</span> program distributed with Microsoft Visual C++. This program can, however, be compiled with any Win32 C compiler (possibly with minor modifications).</p> <p>This program aids release handling on Windows systems. The program is to be called by the <span class=\"code\">erlsrv</span> program, read up the release data file <span class=\"code\">start_erl.data</span>, and start Erlang. Some options to <span class=\"code\">start_erl</span> are added and removed by the release handler during upgrade with emulator restart (more specifically option <span class=\"code\">-data</span>).</p> <p></p>","funcs":" <div class=\"bold_code bc-10\">start_erl [&lt;erl options&gt;] ++ [&lt;start_erl options&gt;]</div><div class=\"REFBODY rb-7\"><p> </p><p>The <span class=\"code\">start_erl</span> program in its original form recognizes the following options:</p> <dl> <dt><strong><span class=\"code\">++</span></strong></dt> <dd> <p>Mandatory. Delimits <span class=\"code\">start_erl</span> options from normal Erlang options. Everything on the command line <strong>before</strong> <span class=\"code\">++</span> is interpreted as options to be sent to the <span class=\"code\">erl</span> program. Everything <strong>after</strong> <span class=\"code\">++</span> is interpreted as options to <span class=\"code\">start_erl</span> itself.</p> </dd> <dt><strong><span class=\"code\">-reldir &lt;release root&gt;</span></strong></dt> <dd> <p>Mandatory if environment variable <span class=\"code\">RELDIR</span> is not specified and no <span class=\"code\">-rootdir</span> option is specified. Tells <span class=\"code\">start_erl</span> where the root of the release tree is located in the file system (typically &lt;Erlang root&gt;\\\\releases). The <span class=\"code\">start_erl.data</span> file is expected to be located in this directory (unless otherwise specified). If only option <span class=\"code\">-rootdir</span> is specified, the directory is assumed to be &lt;Erlang root&gt;\\\\releases.</p> </dd> <dt><strong><span class=\"code\">-rootdir &lt;Erlang root directory&gt;</span></strong></dt> <dd> <p>Mandatory if <span class=\"code\">-reldir</span> is not specified and no <span class=\"code\">RELDIR</span> exists in the environment. This specifies the Erlang installation root directory (under which the <span class=\"code\">lib</span>, <span class=\"code\">releases</span>, and <span class=\"code\">erts-&lt;Version&gt;</span> directories are located). If only <span class=\"code\">-reldir</span> (or environment variable <span class=\"code\">RELDIR</span>) is specified, the Erlang root is assumed to be the directory exactly one level above the release directory.</p> </dd> <dt><strong><span class=\"code\">-data &lt;data file name&gt;</span></strong></dt> <dd> <p>Optional. Specifies another data file than <span class=\"code\">start_erl.data</span> in the &lt;release root&gt;. It is specified relative to the &lt;release root&gt; or absolute (including drive letter, and so on). This option is used by the release handler during upgrade and is not to be used during normal operation. Normally the release data file is not to be named differently.</p> </dd> <dt><strong><span class=\"code\">-bootflags &lt;boot flags file name&gt;</span></strong></dt> <dd> <p>Optional. Specifies a file name relative to the release directory (that is, the subdirectory of &lt;release root&gt; where the <span class=\"code\">.boot</span> file and others are located). The contents of this file is appended to the command line when Erlang is started. This makes it easy to start the emulator with different options for different releases.</p> </dd> </dl> <p></p></div> ","name":"start_erl"}